{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "п\n",
      "д\n",
      "и\n",
      "н\n",
      "к\n"
     ]
    }
   ],
   "source": [
    "#Друзья придумали свой шифр: исходные слова заменять на последовательность нечётных символов в этих словах. \n",
    "#    Например, 'python' в их шифровке будет выглядеть как 'pto'. Напишите программу, которая помогает \n",
    "#    зашифровывать слова по этой схеме: принимает на вход слово (word)\n",
    "#        и последовательно выводит каждый нечётный символ в нём. Для проверки используйте word = 'подшипник'\n",
    "\n",
    "\n",
    "word = 'подшипник'\n",
    "word_new=''\n",
    "for i in range(0,len(word)):\n",
    "      if i%2 ==0:    print(word[i])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "2013 год невисокосный\n",
      "2014 год невисокосный\n",
      "2015 год невисокосный\n",
      "2016 год високосный\n",
      "2017 год невисокосный\n",
      "2018 год невисокосный\n",
      "2019 год невисокосный\n",
      "2020 год високосный\n"
     ]
    }
   ],
   "source": [
    "#Вы решили написать программу, которая выявляет високосные года в диапазоне лет.\n",
    "#Пусть она принимает на вход два числа: нижнюю и верхнюю границы годов (переменные year_1 и year_2), \n",
    "#и для каждого года из диапазона выводит информацию: \"... год високосный\" или \"... год невисокосный\",\n",
    "#где вместо многоточия указывается номер года.\n",
    "\n",
    "#Для проверки используйте year_1 = 2013, year_2 = 2020. Значения обеих переменных должны быть включены в диапазон.\n",
    "\n",
    "\n",
    "year_1 = 2013\n",
    "year_2 = 2020\n",
    "\n",
    "for i in range(year_1,year_2+1): \n",
    "     if i%4 ==0:  print(i,'год високосный')\n",
    "     else: print(i,'год невисокосный')\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "и\n",
      "у\n",
      "а\n",
      "и\n",
      "а\n"
     ]
    }
   ],
   "source": [
    "#Напишите программу,\n",
    "#которая принимает на вход слово (word) и последовательно выводит\n",
    "#все русские гласные из этого слова.\n",
    "#Для проверки используйте word = 'Зимушка-зима'\n",
    "\n",
    "\n",
    "word = 'Зимушка-зима'\n",
    "alf_glas = ('а', 'у', 'о', 'ы', 'и', 'э', 'я', 'ю', 'е')\n",
    "glas=[]\n",
    "for i in word:\n",
    "    if i in alf_glas: print(i)\n",
    "    else: continue"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Буква 1 в этом имени - С\n",
      "Буква 2 в этом имени - е\n",
      "Буква 3 в этом имени - р\n",
      "Буква 4 в этом имени - г\n",
      "Буква 5 в этом имени - е\n",
      "Буква 6 в этом имени - й\n"
     ]
    }
   ],
   "source": [
    "#Попросите пользователя ввести своё имя (name) и с помощью цикла выведите каждую букву этого имени на экран,\n",
    "#сопроводив порядковым номером с помощью фразы: \"Буква ... в этом имени - ...\" \n",
    "#    (например, \"Буква 1 в этом имени - С\"). Для проверки используйте name = 'Сергей'\n",
    "\n",
    "\n",
    "name = 'Сергей'\n",
    "for i in range(0,len(name)):\n",
    "    print('Буква',i+1,'в этом имени -', name[i])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "25\n",
      "27\n",
      "33\n",
      "35\n",
      "39\n",
      "45\n"
     ]
    }
   ],
   "source": [
    "#Напишите программу, которая последовательно выводит нечётные числа, которые делятся на 3 или 5,\n",
    "#от первого введённого числа (num_1) до второго введённого числа (num_2) включительно.\n",
    "#Если второе число меньше первого или первое число меньше нуля, выведите \"Введён неверный диапазон чисел\".\n",
    "#Для проверки используйте num_1 = 25, num_2 = 45\n",
    "\n",
    "num_1 = 25 \n",
    "num_2 = 45\n",
    "\n",
    "if num_1>num_2 or num_1 < 0: print('Введён неверный диапазон чисел')\n",
    "else: \n",
    "    for i in range(num_1,num_2 +1):  \n",
    "                  if i%2 !=0 and  (i%3 ==0  or  i%5 == 0): print(i)\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.6.10"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 4
}
