{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "19\n"
     ]
    }
   ],
   "source": [
    "#Клиент банка открыл вклад под 10% годовых и положил на этот счёт Y рублей. Напишите программу, позволяющую определить, через сколько лет клиент будет иметь на счету сумму не менее Z рублей.\n",
    "#На вход программе идут два числа - Y, Z.\n",
    "#Для проверки используйте Y = 170000, Z = 1000000. \n",
    "#В результате работы программа должна вывести на экран число лет,\n",
    "#которое потребуется для накопления требуемой суммы. Ответ должен быть выведен на экран \n",
    "#в виде целого числа без какого-либо дополнительного поясняющего текста.\n",
    "\n",
    "Y = 170000\n",
    "Z = 1000000\n",
    "year=0\n",
    "\n",
    "while Y < Z:\n",
    "    Y = 1.1 * Y\n",
    "    year +=1\n",
    "else:\n",
    "    print (year)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Перевес 62 кг\n"
     ]
    }
   ],
   "source": [
    "#Пассажирский лифт\n",
    "#имеет ограничение на перевозку: не более 400 кг единовременно. Пусть на вход программе поступает вес (weight) \n",
    "#входящих в лифт людей, а в случае, когда возникает перевес, программа выдаёт предупреждение: \"Перевес ... кг\".\n",
    "#Например, при перевесе в 15 кг должно быть выведено сообщение: \"Перевес 15 кг\". Обратите внимание, что в \n",
    "#эталонной фразе не используются знаки препинания.\n",
    "            \n",
    "#Для проверки используйте weight = 77 и не меняйте его по ходу цикла.\n",
    "\n",
    "lim = 400\n",
    "weight = 77\n",
    "con = 0\n",
    "while con < lim:\n",
    "    con+= weight\n",
    "else:\n",
    "    print(\"Перевес\", con - lim, \"кг\")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "7\n"
     ]
    }
   ],
   "source": [
    "\n",
    "#Вы играете в компьютерную игру, дошли до схватки с финальным боссом, но вот беда: ваш компьютер \"заглючил\", и вы не можете управлять персонажем в игре.\n",
    "#Босс атакует и каждую секунду наносит один удар, который отнимает у вас 80 единиц здоровья. \n",
    "#На схватку с боссом вы вышли с 500 единицами здоровья. Создайте цикл, позволяющий понять, \n",
    "#через сколько секунд босс вас убьет.\n",
    "    \n",
    "#В результате работы программа должна вывести на экран число секунд, в течение которых будет длиться схватка. \n",
    "#Ответ должен быть выведен на экран в виде целого числа без какого-либо дополнительного поясняющего текста.\n",
    "\n",
    "#Для проверки используйте переменную current_health для сохранения текущего уровня здоровья и изменяйте её по \n",
    "#ходу цикла, и — переменную attack = 80 для хранения значения атаки Босса.\n",
    "\n",
    "\n",
    "current_health = 500\n",
    "attack = 80\n",
    "time = 0\n",
    "while current_health > 0:\n",
    "    time=time+1\n",
    "    current_health = current_health - attack\n",
    "else:\n",
    "    print(time)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "10000\n",
      "7200\n",
      "4400\n",
      "1600\n",
      "Слишком большие расходы\n"
     ]
    }
   ],
   "source": [
    "#На банковской карте хранятся 10 000 рублей. Хозяин карты написал программу, \n",
    "#в которую вводит свои расходы (spent), после чего программа показывает баланс (balance). \n",
    "#Баланс выводится в виде целого числа без каких-либо дополнительных сообщений.\n",
    "#Например, при остатке 3500 рублей на экран выводится число 3500. \n",
    "#Когда сумма средств на карте становится ниже нуля, программа выводит сообщение: \"Слишком большие расходы\".\n",
    "\n",
    "#Напишите программу, которая выводит на экран начальный баланс карты (число 10000), \n",
    "#баланс после каждого списания и сообщение \"Слишком большие расходы\" при достижении отрицательного баланса.\n",
    "\n",
    "#Для проверки используйте переменную spent = 2800 и НЕ меняйте её по ходу цикла. \n",
    "#Переменная balance должна меняться после каждого шага цикла.\n",
    "\n",
    "\n",
    "spent = 2800\n",
    "balance=10000\n",
    "print(balance)\n",
    "\n",
    "while balance>0:\n",
    "    balance = balance-spent\n",
    "    if balance<0:\n",
    "        print('Слишком большие расходы')\n",
    "        #if balance - spent < 0: break\n",
    "    else:\n",
    "        print(balance)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "20\n"
     ]
    }
   ],
   "source": [
    "#Представьте, что перед вами большая цистерна объёмом 1000 литров, которую необходимо заполнить водой. \n",
    "#У вас есть робот, который доставляет в цистерну сначала 5 литров, а затем каждый раз на 5 литров больше,\n",
    "#чем в предыдущий. Изначально в цистерне нет воды. Через сколько заходов робота вода польётся через край?\n",
    "\n",
    "#В результате работы программа должна вывести на экран число заходов, необходимых роботу для заполнения \n",
    "#цистерны до краёв. Ответ должен быть выведен на экран в виде целого числа без какого-либо дополнительного \n",
    "#поясняющего текста.\n",
    "\n",
    "#Для проверки используйте переменную volume, равную свободному объёму в цистерне, и меняйте её по ходу цикла \n",
    "#(на последнем шаге она должна быть меньше нуля).\n",
    "\n",
    "volume = 1000\n",
    "countAdd = 0\n",
    "attempt = 0\n",
    "while volume > 0:\n",
    "    countAdd += 1\n",
    "    volume -= countAdd*5\n",
    "    attempt += 1\n",
    "print(attempt)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.6.10"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 4
}
